app/views/articles/_form.html.erb

SELECT "categories".* FROM "categories"
---
                <div class="col-sm-offset-2 col-sm-8">
                    <strong><p>Categories:</p></strong><%= f.collection_check_boxes :category_ids, Category.all, :id, :name do |cb| %>