app/views/articles/show.html.erb

                        </li>
                        <li><small><%= pluralize(@article.user.articles.count, "article") if @article.user.articles %></small></li>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]

        <%=simple_format(@article.description)%>
        <% if @article.categories.any? %>
---
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = $1 LIMIT $2  [["article_id", 1], ["LIMIT", 1]]