app/views/users/index.html.erb

SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = $1  [["user_id", 1]]
---
                    </li>
                    <li><small><%= pluralize(user.articles.count, "article") if user.articles %></small></li>