app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "sdssss"], ["description", "ss11111111111111111111122222"], ["user_id", 1], ["created_at", 2016-12-11 06:05:43 UTC], ["updated_at", 2016-12-11 06:05:43 UTC]]
---
    def create
        @article = Article.new(article_params)
        @article.user = current_user
        if @article.save