app/controllers/users_controller.rb

    def update

        if @user.update(user_params)
---
UPDATE "users" SET "username" = $1, "password_digest" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["username", "arsy209"], ["password_digest", "$2a$10$K0XX/W22qxer5nZR8wfpCe.7UOr1DvT4V6bQaTGZvSIgBZofRD7Nu"], ["updated_at", 2016-12-11 15:41:26 UTC], ["id", 1]]