app/views/layouts/_navigation.html.erb

SELECT "categories".* FROM "categories"
---
              <li> <%= link_to "All categories", categories_path %> </li>
              <% Category.all.each do |category| %>